#include <iostream>
using namespace std;

void main()
{
	setlocale(0, "");

	cout << "\t\t\t\t\t\tВ лесу родилась ёлочка,\n";
	cout << "\t\t\t\t\t\tВ лесу она росла,\n";
	cout << "\t\t\t\t\t\tЗимой и летом стройная,\n";
	cout << "\t\t\t\t\t\tЗеленая была.\n\n";

	cout << "\t\t\t\t\t\tМетель ей пела песенку:\n";
	cout << "\t\t\t\t\t\t\"Спи, ёлочка, бай - бай!\"\n";
	cout << "\t\t\t\t\t\tМороз снежком укутывал:\n";
	cout << "\t\t\t\t\t\t\"Смотри, не замерзай!\"\n\n";

	cout << "\t\t\t\t\t\tТрусишка зайка серенький\n";
	cout << "\t\t\t\t\t\tПод ёлочкой скакал,\n";
	cout << "\t\t\t\t\t\tПорою волк, сердитый волк,\n";
	cout << "\t\t\t\t\t\tРысцою пробегал.\n\n";

	cout << "\t\t\t\t\t\tЧу!Снег по лесу частому\n";
	cout << "\t\t\t\t\t\tПод полозом скрипит.\n";
	cout << "\t\t\t\t\t\tЛошадка мохноногая\n";
	cout << "\t\t\t\t\t\tТоропится, бежит.\n\n";
	
	cout << "\t\t\t\t\t\tВезёт лошадка дровенки,\n";
	cout << "\t\t\t\t\t\tНа дровнях - мужичок\n";
	cout << "\t\t\t\t\t\tСрубил он нашу ёлочку\n";
	cout << "\t\t\t\t\t\tПод самый корешок.\n\n";

	cout << "\t\t\t\t\t\tТеперь она, нарядная,\n";
	cout << "\t\t\t\t\t\tНа праздник к нам пришла,\n";
	cout << "\t\t\t\t\t\tИ много, много радости\n";
	cout << "\t\t\t\t\t\tДетишкам принесла.\n\n";
}